### <a name='0'></a> Import of libraries

In [3]:
import numpy as np
import pandas as pd

pd.__version__

'0.25.1'

### <a name='1'></a>  1
From the list below:
```
stocks = ['PLW', 'CDR', '11B', 'TEN']
```
Create a Series object.

__Expected result:__

```
0    PLW
1    CDR
2    11B
3    TEN
dtype: object
```

In [42]:
# enter solution here
stocks = ['PLW', 'CDR', '11B', 'TEN']
df=pd.Series(stocks)
df

0    PLW
1    CDR
2    11B
3    TEN
dtype: object

### <a name='2'></a>  2
From the dictionary below:

```
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
```
Create a Series object and assign it to the _quotations_ variable.

__Expected result:__

```
PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
dtype: float64
```

In [43]:
# enter solution here
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
df=pd.Series(stocks)
df

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
dtype: float64

### <a name='3'></a>  3

Convert _quotations_ to a list.

__Expected result:__
```
[387.0, 339.5, 349.5, 391.0]
```

In [44]:
# enter solution here
list(df)

[387.0, 339.5, 349.5, 391.0]

### <a name='4'></a>  4
Convert the _quotations_ object to the _DataFrame_ object. Set the column name to _price_.

In [46]:
# enter solution here

df2=pd.DataFrame()

df2['price'] = list(df)

df2

   price
0  387.0
1  339.5
2  349.5
3  391.0

### <a name='5'></a>  5
Using the _numpy_ library, build the following _Series_ object:

```
101    10.0
102    20.0
103    30.0
104    40.0
105    50.0
106    60.0
107    70.0
108    80.0
109    90.0
dtype: float64
```

In [53]:
# enter solution here
data1=list(np.array(range(101,110)))
data2 = list(np.array(range(10,100,10), dtype="float"))
df3= pd.Series(data2,data1)
print(df3)

101    10.0
102    20.0
103    30.0
104    40.0
105    50.0
106    60.0
107    70.0
108    80.0
109    90.0
dtype: float64

### <a name='6'></a>  6
The following object of type _Series_ is given:
```
series = pd.Series(['001', '002', '003', '004'], list('abcd'))
```
Convert object type _series_ to _int_ values.

In [56]:
# enter solution here
series = pd.Series(['001', '002', '003', '004'], list('abcd'), dtype='int32')
series

a    1
b    2
c    3
d    4
dtype: int32

Convert object type _series_ to _float_ values.

In [57]:
# enter solution here
series = pd.Series(['001', '002', '003', '004'], list('abcd'), dtype='float')
series

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

### <a name='7'></a>  7
To the following _quotations_ object:
```
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
quotations = pd.Series(data=stocks)
```
Add two elements:
* key: BBT, value: 25.5
* key: F51, value: 19.2

__Expected result:__
```
PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
BBT     25.5
F51     19.2
dtype: float64
```

In [66]:
# enter solution here
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
quotations = pd.Series(data=stocks)
appenddata = pd.Series(data= {'BBT': 25.5,'F51': 19.2})
newquotations= quotations.append(appenddata)
newquotations

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
BBT     25.5
F51     19.2
dtype: float64

### <a name='8'></a>  8
Convert the _quotations_ object from the previous exercise to an _DataFrame_ object. Reset the index and name the columns '_ticker_' and _'price'_.

In [68]:
# enter solution here
dfnew= pd.DataFrame(newquotations)
dfnew

         0
PLW  387.0
CDR  339.5
TEN  349.5
11B  391.0
BBT   25.5
F51   19.2

### <a name='9'></a>  9

Build the _DataFrame_ object below and assign it to the _companies_ variable:

|    | company   |   price | ticker   |
|---:|:----------|--------:|:---------|
|  0 | Amazon    |  2375   | AMZN.US  |
|  1 | Microsoft |   178.6 | MSFT.US  |
|  2 | Facebook  |   179.2 | FB.US    |

In [94]:
# enter solution here
d={'company':['Amazon','Microsoft','Facebook'], 'price':[2375,178.6,179.2],'ticket':['AMZN.US','MSFT.US','FB.US']}
df=pd.DataFrame(d, columns = ['company','price','ticket'])
df

     company   price   ticket
0     Amazon  2375.0  AMZN.US
1  Microsoft   178.6  MSFT.US
2   Facebook   179.2    FB.US

### <a name='10'></a>  10
Convert the first column of the _companies_ object to an index.

In [95]:
# enter solution here
# df=pd.DataFrame(df, columns=['price','ticket'], index=d['company'])
df=df.set_index('company')
df.index.name= None # 2 level of heading to one level
df

            price   ticket
Amazon     2375.0  AMZN.US
Microsoft   178.6  MSFT.US
Facebook    179.2    FB.US

Extract row for company _Facebook_ from object _companies_.

In [99]:
# enter solution here
df.iloc[[2]] # based on index
df.loc[['Facebook']] # based on solid name index

          price ticket
Facebook  179.2  FB.US

Extract price for _Microsoft_

In [ ]:
# enter solution here

### <a name='1'></a>  11
Build the _DatetimeIndex_ object containing the `yyyy-mm-dd` format dates for all days from January 2020 and assign it to the _date_range_ variable.

__Expected result:__
```
DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20',
               '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24',
               '2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30', '2020-01-31'],
              dtype='datetime64[ns]', freq='D')
```

In [ ]:
# enter solution here

Build the _Series_ object from the _date_range_ variable.

In [ ]:
pd.Series(date_range)

### <a name='2'></a>  12
Build the _DatetimeIndex_ object containing the dates in the `yyyy-mm-dd` format for all Mondays from 2020 and assign it to the _date_range_ variable.

In [ ]:
# enter solution here

### <a name='3'></a>  13
Build the _DatetimeIndex_ object containing the dates in the format `yyyy-mm-dd hh: mm: ss` for January 1, 2021 with a time interval of 1h and assign to the variable _date_range_.

__Expected result:__
```
DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 01:00:00',
               '2021-01-01 02:00:00', '2021-01-01 03:00:00',
               '2021-01-01 04:00:00', '2021-01-01 05:00:00',
               '2021-01-01 06:00:00', '2021-01-01 07:00:00',
               '2021-01-01 08:00:00', '2021-01-01 09:00:00',
               '2021-01-01 10:00:00', '2021-01-01 11:00:00',
               '2021-01-01 12:00:00', '2021-01-01 13:00:00',
               '2021-01-01 14:00:00', '2021-01-01 15:00:00',
               '2021-01-01 16:00:00', '2021-01-01 17:00:00',
               '2021-01-01 18:00:00', '2021-01-01 19:00:00',
               '2021-01-01 20:00:00', '2021-01-01 21:00:00',
               '2021-01-01 22:00:00', '2021-01-01 23:00:00'],
              dtype='datetime64[ns]', freq='H')
```

In [ ]:
# enter solution here

### <a name='4'></a>  14
Build the _DataFrame_ object below.

__Tips:__ The _day_ column contains dates from March 1, 2021 to March 31, 2021. The column _day_of_year_ is the day number of the whole year.

```
      day	       day_of_year
 0	2021-03-01	60
 1	2021-03-02	61
 2	2021-03-03	62
 3	2021-03-04	63
 4	2021-03-05	64
 5	2021-03-06	65
 6	2021-03-07	66
 7	2021-03-08	67
 8	2021-03-09	68
 9	2021-03-10	69
10	2021-03-11	70
11	2021-03-12	71
12	2021-03-13	72
13	2021-03-14	73
14	2021-03-15	74
15	2021-03-16	75
16	2021-03-17	76
17	2021-03-18	77
18	2021-03-19	78
19	2021-03-20	79
20	2021-03-21	80
21	2021-03-22	81
22	2021-03-23	82
23	2021-03-24	83
24	2021-03-25	84
25	2021-03-26	85
26	2021-03-27	86
27	2021-03-28	87
28	2021-03-29	88
29	2021-03-30	89
30	2021-03-31	90
```

In [ ]:
# enter solution here

### <a name='5'></a>  15

The following _data_dict_ dictionary is given.
```
data_dict = {
    'normal': np.random.normal(loc=0, scale=1, size=1000),
    'uniform': np.random.uniform(low=0, high=1, size=1000),
    'binomial': np.random.binomial(n=1, p=0.2, size=1000)
}
```
Build the _DateFrame_ object from this dictionary. Additionally, as an index, add a date from 01/01/2020 and assign it to the _df_ variable.

In [ ]:
data_dict = {
    'normal': np.random.normal(loc=0, scale=1, size=1000),
    'uniform': np.random.uniform(low=0, high=1, size=1000),
    'binomial': np.random.binomial(n=1, p=0.2, size=1000)
}

# enter solution here

### <a name='6'></a>  16
Display the first 10 rows of the _df_ object from the previous exercise.

In [ ]:
# enter solution here

Display the last 8 rows of the df object from the previous exercise.

In [ ]:
# enter solution here

### <a name='7'></a>  17
Display basic information about the _df_ object (number of rows, number of columns, type of variables).

In [ ]:
# enter solution here

Display basic statistics of _df_ (mean value, deviation, min, max, median).

In [ ]:
# enter solution here

### <a name='8'></a>  18
Import the _seaborn_ library for data visualization.

In [ ]:
import seaborn as sns

sns.set()

Using the _pd.DataFrame.plot_ method, build histograms for the next three variables.
* normal (20 bins)

In [ ]:
# enter solution here

* uniform (30 bins)

In [ ]:
# enter solution here

* binomial

In [ ]:
# enter solution here

### <a name='9'></a>  19
Save the _df_ object to the _'dataframe.csv'_ file.

In [ ]:
# enter solution here

Check the solution

In [ ]:
!head -5 dataframe.csv

### <a name='10'></a>  20
Load the _dataframe.csv_ file into the _df_new_ variable (remember to load the index correctly).

In [ ]:
# enter solution here

The _fetch_financial_data()_ function fetches data on listed companies. It will be used in the following exercises. To download data of a specific company, you must provide the ticker (symbol) of the company.

Some sample company tickers:
* AMZN - Amazon
* GOOGL - Google
* MSFT - Microsoft
* AAPL - Apple
* NKE - Nike
* WMT - Walmart

In [ ]:
def fetch_financial_data(company='AMZN'):
    """
    This function fetches stock market quotations.
    """
    import pandas_datareader.data as web
    return web.DataReader(name=company, data_source='stooq')

### <a name='1'></a>  21
Using the _fetch_financial_data()_ function, download Google (Alphabet) quotes and assign to the variable _google_. Display object _google_.

In [ ]:
# enter solution here

### <a name='2'></a>  22
Display basic information about _google_ object.

In [ ]:
# enter solution here

Display basic statistics for _google_.

In [ ]:
# enter solution here

Note the precision of individual statistics.
Try setting the appropriate _pandas_ library options to display data with two decimal places.

__Tip:__ 
https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html

In [ ]:
# enter solution here

__Additionally:__
The following setting will also suppress mathematical notation (see column _Volume_).

In [ ]:
pd.options.display.float_format = '{:.2f}'.format
google.describe()

Build a simple chart for _google_ closing price (_Close_)

In [ ]:
# enter solution here

### <a name='3'></a>  23
Replace the _Date_ index with a column. Permanently assign changes to the _google_.

In [ ]:
# enter solution here

Assign two new columns to the _google_ object by adding a column with the current month number named _'Month'_ and the year named _'Year'_.

In [ ]:
# enter solution here

### <a name='4'></a>  24
Compute the average closing price (_Close_) for a particular year (group data by year - column _Year_ and then calculate the average value).

In [ ]:
# enter solution here

Present the obtained values on the graph using the _plot()_ method.

In [ ]:
# enter solution here

Compute the average closing price (_Close_) for the month (group data by month - the _Month_ column and then count the average value).

In [ ]:
# enter solution here

Present the obtained values on the graph using the _plot()_ method.
Note which months may indicate weaker periods on the stock market.

In [ ]:
# enter solution here

### <a name='5'></a>  25
Group data from _google_ at year and month level. Then calculate the average value.

In [ ]:
# enter solution here

### <a name='6'></a>  26
Find the index for which the _Close_ column has the largest value.

In [ ]:
# enter solution here

Extract the row for this index from the google object as a DataFrame. Read the date.

In [ ]:
# enter solution here

### <a name='7'></a>  27
Extract the columns _Date_, _Open_, _Close_, _Volume_ from the _google_ object.
Don't change the original _google_ object!

In [ ]:
# enter solution here

### <a name='8'></a>  28
Set the index for the _Date_ column back. Display object _google_.

In [ ]:
# enter solution here

### <a name='9'></a>  29
Permanently remove the _Year_ and _Month_ columns from the _google_ object. Display object _google_.

In [ ]:
# enter solution here

### <a name='10'></a>  30

Assign the following values to the column names:
* Open -> O
* High -> H
* Low -> L
* Close -> C
* Volume -> V

to object _google_. Siaplay object _google_.

In [ ]:
# enter solution here

### <a name='1'></a>  31

Load the csv file into a DataFrame object named _df_raw_ with the default parameters of the _pd.read_csv()_ function and display the first 5 rows.
File url:
* https://ml-repository-krakers.s3-eu-west-1.amazonaws.com/kaggle+/churn_modelling/Telco-Customer-Churn.csv

In [ ]:
# enter solution here

Copy the _df_raw_ object to the _df_ variable.

In [ ]:
# enter solution here

Display basic information about the object _df_.

In [ ]:
# enter solution here

Determine the number of missing elements (_np.nan_) in the _df_ object for each variable.

In [ ]:
# enter solution here

### <a name='2'></a>  32
Note the _TotalCharges_ column. The type of this column is _object_. Try to guess why this happened.

__Tip:__
Look at the variable distribution.

In [ ]:
# enter solution here

Note that we have 11 null values. To see it better, see below.

In [ ]:
df['TotalCharges'].value_counts()[:3].index

This is a space character that has crept into our data. He made the pandas read the entire column as text. As an analyst, we have to deal with such problems. Try to replace the missing values of the _TotalCharges_ column with its median.

In [ ]:
# enter solution here

Check if the type has been changed correctly.

In [ ]:
# enter solution here

### <a name='3'></a>  33
Convert columns from the list below _categorical_ to type _category_.

In [ ]:
# enter solution here

Convert columns from the list below _numerical_ to type _float_.

In [ ]:
# enter solution here

Set the _customerID_ column as the index of the _df_ object and display info about the _df_ object.

In [ ]:
# enter solution here

### <a name='4'></a>  34
Use the _describe()_ method to display basic statistics for the _df_ object.

In [ ]:
# enter solution here

Note that these are only numeric variables. Display the basic statistics of categorical variables by passing the appropriate parameter _include_ of the _describe()_ method.

In [ ]:
# enter solution here

Note that these are slightly different statistics than for numeric variables.

### <a name='5'></a>  35
Find the distribution of values for the _Churn_ variable.

In [ ]:
# enter solution here

Build a pie chart of the distribution of the _Churn_ variable.

In [ ]:
# enter solution here

### <a name='6'></a>  36
Build the _pairplot()_ chart from the _seaborn_ library. Pass variables:
* tenure
* MonthlyCharges
* TotalCharges


and the parameter: _hue = 'Churn'_.

__Tip:__
https://seaborn.pydata.org/generated/seaborn.pairplot.html

In [ ]:
# enter solution here

### <a name='7'></a>  37
Map the _Churn_ column accordingly:
* 'Yes' -> 1
* 'No' -> 0

Display the first 5 rows of _df_.

In [ ]:
# enter solution here

### <a name='8'></a>  38
Calculate the correlation matrix for the _df_ object.

In [ ]:
# enter solution here

### <a name='9'></a>  39
Find the distribution of _PaymentMethod_.

In [ ]:
# enter solution here

Group data by the _PaymentMethod_ variable and calculate the average value for the _TotalCharges_ variable.

In [ ]:
# enter solution here

### <a name='10'></a>  40
Take a sample of 10 rows from the _df_ object and save to _sample_10.csv_.

In [ ]:
# enter solution here

Run the cell below to check.

In [ ]:
! cat sample_10.csv

### <a name='1'></a>  41
Two _Series_ objects are given:
```
s1 = pd.Series(np.random.rand(20))
s2 = pd.Series(np.random.randn(20))
```
Combine these two objects into one _DataFrame_ object (as two columns) and assign to _df_. Name the columns _col1_ and _col2_ respectively.

In [ ]:
# enter solution here

### <a name='2'></a>  42
Extract rows from the _df_ object for which the value in the _col2_ column is between 0.0 and 1.0 (inclusive).

In [ ]:
# enter solution here

### <a name='3'></a>  43
Assign a new column named _col3_, which will have a value of 1 when the value in the column _col2_ is non-negative and -1 opposite.

In [ ]:
# enter solution here

### <a name='4'></a>  44

Assign a new column _col4_, which will truncate the values from the column _col2_ to the range $ [- 1.0, 1.0] $.
In other words, for values below -1.0, leave -1.0, for values above 1.0, leave 1.0.

In [ ]:
# enter solution here

### <a name='5'></a>  45
Find the top 5 values for the _col2_ column.

In [ ]:
# enter solution here

Find the 5 lowest values for the _col2_ column.

In [ ]:
# enter solution here

### <a name='6'></a>  46
Calculate the cumulative sum for each column.

__Tip:__ Use the _pd.DataFrame.cumsum()_ method.

In [ ]:
# enter solution here

### <a name='7'></a>  47
Calculate the median for the _col2_ variable (or 0.5 quantile).

In [ ]:
# enter solution here

### <a name='8'></a>  48
Extract rows for which the variable _col2_ takes values greater than 0.0.

In [ ]:
# enter solution here

### <a name='9'></a>  49
Extract first 5 rows of the _df_ object and convert it to a dictionary.

In [ ]:
# enter solution here

### <a name='10'></a> Exercise 50
Extract the first 5 rows of the _df_ object, convert it to Markdown format, and assign it to the _df_markdown_ variable.

In [ ]:
# enter solution here

Print the contents of the _df_markdown_ variable to the console.

In [ ]:
# enter solution here

Copy the result of running the above cell and paste below:

|    |     col1 |      col2 |   col3 |      col4 |
|---:|---------:|----------:|-------:|----------:|
|  0 | 0.292145 |  0.822545 |      1 |  0.822545 |
|  1 | 0.366362 | -1.22084  |     -1 | -1        |
|  2 | 0.45607  |  0.208864 |      1 |  0.208864 |
|  3 | 0.785176 | -1.95967  |     -1 | -1        |
|  4 | 0.199674 | -1.32819  |     -1 | -1        |

### <a name='1'></a> Exercise 51
The following _DataFrame_ object is given:
```
df = pd.DataFrame(np.random.rand(10, 4), columns=list('ABCD'))
```

In [ ]:
# enter solution here

Extract the rows of the _df_ object for which the _C_ column is greater than 0.8.

In [ ]:
# enter solution here

### <a name='2'></a> Exercise 52
Extract the rows of the _df_ object for which the _C_ column is greater than 0.3 and the _D_ column is less than 0.7.

In [ ]:
# enter solution here

### <a name='3'></a> Exercise 53
Iterate through the first five rows of the _df_ object. Print each row to the console.

__Tip:__ Use the _pd.DataFrame.iterrows()_ function.

In [ ]:
# enter solution here

### <a name='4'></a> Exercise 54
Set the value in row with index 3 for column B as _np.nan_.
Use _df.iloc_.

In [ ]:
# enter solution here

Set the value in the row at index 8 for column D as _np.nan_. Use _df.loc_.

In [ ]:
# enter solution here

### <a name='5'></a> Exercise 55
Delete all rows from object _df_ containing missing values and assign to variable _df1_. Display variable _df1_.

In [ ]:
# enter solution here

### <a name='6'></a> Exercise 56
Note that the index after removing two rows in the _df1_ object is not in turn. Reset the index (do not add a new column, just reset the index). Display variable _df1_.

In [ ]:
# enter solution here

### <a name='7'></a> Exercise 57
Let's go back to the _df_  object. Determine the number of missing elements in the _df_ object for each column.

In [ ]:
# enter solution here

### <a name='8'></a> Exercise 58
Fill in the missing values with the value 0 and assign to the variable _df_.

In [ ]:
# enter solution here

### <a name='9'></a> Exercise 59
Replace the order of the columns in the _df_ object with the one given below:
* D, A, B, C

and assign to _df_.

In [ ]:
# enter solution here

### <a name='10'></a> Exercise 60
Remove the $ D $ column from the _df_ object.

In [ ]:
# enter solution here

### <a name='1'></a> Exercise 61
Load the csv file into the _DataFrame_ object named _df_:

* https://storage.googleapis.com/esmartdata-courses-files/dash-course/data.csv

Set the index to the first column. Display object _df_.

In [ ]:
# enter solution here

Display information about the object _df_.

In [ ]:
# enter solution here

Display basic statistics of an object _df_.

In [ ]:
# enter solution here

### <a name='2'></a> Exercise 62
Find the list containing the names of all columns of the _df_ object.

In [ ]:
# enter solution here

From the df object, remove the column named New_Price and display the first 5 rows.

In [ ]:
# enter solution here

### <a name='3'></a> Exercise 63
Find the number of missing values for each object variable _df_.

In [ ]:
# enter solution here

Delete all rows with missing values in the _df_ object. Use the `inplace = True` parameter.

In [ ]:
# enter solution here

### <a name='4'></a> Exercise 64
Replace all letters in column names with lowercase letters, e.g.
* Name -> name
* Fuel_Type -> fuel_type

Display the first five rows using the _head()_ method.

In [ ]:
# enter solution here

### <a name='5'></a> Exercise 65
Find the distribution of the _owner_type_ variable.

In [ ]:
# enter solution here

Find the distribution of the _engine_ variable.

In [ ]:
# enter solution here

Note that the variable _engine_ is of type _object_. Remove the last 3 characters from each element and convert to _int_. Display the first five rows using the _head()_ method.

In [ ]:
# enter solution here

### <a name='6'></a> Exercise 66
Look at the distribution of the _power_ variable. Note that this variable also has missing values in the form of the _'null bhp'_ value. Replace these values for _power_ with _np.nan_. Use the _np.where()_ function for this.

In [ ]:
# enter solution here

Delete all rows with missing values again.

In [ ]:
# enter solution here

### <a name='7'></a> Exercise 67
Note that the _power_ variable is of type _object_. Remove the last 4 characters from each element and convert to float type.

Display the first five rows using the _head()_ method.

In [ ]:
# enter solution here

### <a name='8'></a> Exercise 68
Group data at year level (_year_) and count the number of rows for each year.

In [ ]:
# enter solution here

### <a name='9'></a> Exercise 69
Check the distribution of the _transmission_ variable.

In [ ]:
# enter solution here

Perform the following mapping of the _transmission_ variable:
* Manual -> 0
* Automatic -> 1

Display the first five rows using the _head()_ method.

In [ ]:
# enter solution here

### <a name='10'></a> Exercise 70
Save the _df_ object to the _car.csv_ file (do not save the index).

In [ ]:
# enter solution here

Run the following instructions to check.

In [ ]:
!head car.csv

Run the following code to download the _london_bike.csv_ file to your working directory.

In [ ]:
!wget -q https://storage.googleapis.com/esmartdata-courses-files/ds-bootcamp/london_bike.csv

### <a name='1'></a> Exercise 71
Load the _london_bike.csv_ file into the DataFrame object named _df_ and display basic information about the object.

In [ ]:
# enter solution here

Display the first five rows of _df_.

In [ ]:
# enter solution here

Display the last five rows of _df_.

In [ ]:
# enter solution here

### <a name='2'></a> Exercise 72
Note that the _timestamp_ column is of type _object_. Replace it with _datetime_.

__Tip:__ Use the _pd.to_datetime()_ function.

In [ ]:
# enter solution here

Add a new column named _hour_ to the _df_ object and assign the time from the _timestamp_ column. Display the first five rows of the _df_ object.

In [ ]:
# enter solution here

### <a name='3'></a> Exercise 73
Add a new column named _month_ to the _df_ object and assign the month from the _timestamp_ column. Display the first five rows of the _df_ object.

In [ ]:
# enter solution here

Group data by month (_month_) and calculate the average value for the variable _hum_. Assign the result to _humidity_by_month_ and reset the index.

In [ ]:
# enter solution here

Using the _plotly express_ library, build a line chart of the average value of the _hum_ variable for a given month (use the _humidity_by_month_ object).

__Tip:__ Use the _px.line()_ function.

In [ ]:
# enter solution here

Build the same chart this time using the _plotly_dark_ template.

In [ ]:
# enter solution here

Read for which month the average value of the _hum_ variable is the smallest and for which it is the largest.

### <a name='4'></a> Exercise 74
Group data at the hour level (_hour_) and then determine the average value of the variable _cnt_. Assign the result to the variable _cnt_by_hour_ and reset the index.

In [ ]:
# enter solution here

Using the _plotly express_ library, build a line chart of the average value of the _cnt_ variable by hours (use the _cnt_by_hour_ object).

In [ ]:
# enter solution here

### <a name='5'></a> Exercise 75
Group data by variables _is_weekend_ and _hour_ and determine the average value of the variable _cnt_. Assign the result to the variable _cnt_by_weekend_hour_ and reset the index.

In [ ]:
# enter solution here

Using the _plotly express_ library, build a line chart of the average value of the _cnt_ variable by hours __on non-weekend days__ (use the _cnt_by_weekend_hour_ object). Set the title of the chart: 'Out of the weekend'.

In [ ]:
# enter solution here

Using the _plotly express_ library, build a line chart of the average value of _cnt_ by hour __on weekend days__ (use the _cnt_by_weekend_hour_ object). Set the chart title: 'Weekends'.

In [ ]:
# enter solution here

Are there any differences between non-weekend days and weekend days?

### <a name='6'></a> Exercise 76
Using the _plotly express_ library, build the histogram of the _cnt_ variable. Add chart title: 'Histogram of the cnt variable'.

In [ ]:
# enter solution here

Also add a box chart to the histogram.

__Tip:__ Use parameter _marginal_ of function _px.histogram()_.

In [ ]:
# enter solution here

### <a name='7'></a> Exercise 77
Extract rows for which the _wind_speed_ variable is less than 10.0 and the _hum_ variable is greater than 90.0.

In [ ]:
# enter solution here

### <a name='8'></a> Exercise 78
Extract rows for which the _is_weekend_ variable is 1.0. Then copy the result and assign it to the _df_weekend_ variable.

In [ ]:
# enter solution here

### <a name='9'></a> Exercise 79
Save the _df_weekend_ object to the _weekend.xlsx_ file. Name the worksheet _london_bike_ and skip saving the index to a file.

In [ ]:
# enter solution here

### <a name='10'></a> Exercise 80
Save the first 10 rows of the _df_weekend_ object to the _head10.html_ file.

In [ ]:
# enter solution here

Run the following instructions to download the _insurance.csv_ file to your working directory.

In [1]:
!wget -q https://storage.googleapis.com/esmartdata-courses-files/ml-course/insurance.csv

'wget' is not recognized as an internal or external command,
operable program or batch file.

### <a name='1'></a> Exercise 81
Load the _insurance.csv_ file into the DataFrame object _df_raw_ and display the first few rows.

In [4]:
# enter solution here
df_raw=pd.read_csv("insurance.csv")
df_raw.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

Copy the _df_raw_ object to the _df_ variable and display basic information about the _df_ object.

In [5]:
# enter solution here
df=df_raw.copy()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
age         1338 non-null int64
sex         1338 non-null object
bmi         1338 non-null float64
children    1338 non-null int64
smoker      1338 non-null object
region      1338 non-null object
charges     1338 non-null float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

### <a name='2'></a> Exercise 82
Check if there are duplicate rows in the _df_ object. If so, display these rows.

In [6]:
# enter solution here
df[df.duplicated()]

     age   sex    bmi  children smoker     region    charges
581   19  male  30.59         0     no  northwest  1639.5631

Delete duplicates in object _df_.

In [7]:
# enter solution here
df = df.drop(df[df.duplicated()].index)

In [8]:
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1337 rows x 7 columns]

### <a name='3'></a> Exercise 83
Display variables from the object _df_ with the type _object_.

__Tip:__ Use the _pd.DataFrame.select_dtypes()_ method.

In [9]:
# enter solution here

df.select_dtypes(include ='object')

         sex smoker     region
0     female    yes  southwest
1       male     no  southeast
2       male     no  southeast
3       male     no  northwest
4       male     no  northwest
...      ...    ...        ...
1333    male     no  northwest
1334  female     no  northeast
1335  female     no  southeast
1336  female     no  southwest
1337  female    yes  northwest

[1337 rows x 3 columns]

Convert these variables to categorical variables.

__Tip:__ Use the _pd.DataFrame.astype()_ method.

In [10]:
# enter solution here
df= df.astype({"sex":'category',"smoker":'category',"region":'category'})

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1337 entries, 0 to 1337
Data columns (total 7 columns):
age         1337 non-null int64
sex         1337 non-null category
bmi         1337 non-null float64
children    1337 non-null int64
smoker      1337 non-null category
region      1337 non-null category
charges     1337 non-null float64
dtypes: category(3), float64(2), int64(2)
memory usage: 56.5 KB

Display numeric variables (_float_, _int_) from the object _df_.

__Tip:__ Use the _pd.DataFrame.select_dtypes()_ method

In [12]:
# enter solution here

df.select_dtypes(exclude ='category')

      age     bmi  children      charges
0      19  27.900         0  16884.92400
1      18  33.770         1   1725.55230
2      28  33.000         3   4449.46200
3      33  22.705         0  21984.47061
4      32  28.880         0   3866.85520
...   ...     ...       ...          ...
1333   50  30.970         3  10600.54830
1334   18  31.920         0   2205.98080
1335   18  36.850         0   1629.83350
1336   21  25.800         0   2007.94500
1337   61  29.070         0  29141.36030

[1337 rows x 4 columns]

Find the names of numeric variables (_float_, _int_) from the object _df_.

In [13]:
# enter solution here
df.select_dtypes(exclude ='category').columns

Index(['age', 'bmi', 'children', 'charges'], dtype='object')

### <a name='4'></a> Exercise 84
Follow the steps below:

* assign to the variable _df_cat_ categorical variables from the object _df_ and create a copy of them.

* assign to the variable _df_num_ numerical variables from the object _df_ and create a copy of them.

In [14]:
# enter solution here
df_cat = df.select_dtypes(include ='category').copy()
df_num = df.select_dtypes(exclude ='category').copy()

Display the first 5 rows of the _df_cat_ object.

In [15]:
# enter solution here
df_cat.head()

      sex smoker     region
0  female    yes  southwest
1    male     no  southeast
2    male     no  southeast
3    male     no  northwest
4    male     no  northwest

Display the first 5 rows of _df_num_.

In [16]:
# enter solution here
df_num.head()

   age     bmi  children      charges
0   19  27.900         0  16884.92400
1   18  33.770         1   1725.55230
2   28  33.000         3   4449.46200
3   33  22.705         0  21984.47061
4   32  28.880         0   3866.85520

### <a name='5'></a> Exercise 85
Display basic statistics of the _df_cat_ object.

In [17]:
# enter solution here
df_cat.describe()

         sex smoker     region
count   1337   1337       1337
unique     2      2          4
top     male     no  southeast
freq     675   1063        364

Display basic statistics of the object _df_num_.

In [18]:
# enter solution here
df_num.describe()

               age          bmi     children       charges
count  1337.000000  1337.000000  1337.000000   1337.000000
mean     39.222139    30.663452     1.095737  13279.121487
std      14.044333     6.100468     1.205571  12110.359656
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.290000     0.000000   4746.344000
50%      39.000000    30.400000     1.000000   9386.161300
75%      51.000000    34.700000     2.000000  16657.717450
max      64.000000    53.130000     5.000000  63770.428010

Display basic statistics of the _df_ object for numeric variables and transpose the resulting _DataFrame_ object.

In [19]:
# enter solution here
df.describe(exclude=['category']).transpose()

,count,mean,std,min,25%,50%,75%,max
age,1337.0,39.222139,14.044333,18.0000,27.000,39.0000,51.00000,64.00000
bmi,1337.0,30.663452,6.100468,15.9600,26.290,30.4000,34.70000,53.13000
children,1337.0,1.095737,1.205571,0.0000,0.000,1.0000,2.00000,5.00000
charges,1337.0,13279.121487,12110.359656,1121.8739,4746.344,9386.1613,16657.71745,63770.42801

Display basic statistics of the _df_ object for numeric variables, transpose the resulting _DataFrame_ object and extract the two columns _mean_ and _std_.

In [20]:
# enter solution here
df.describe(exclude=['category']).transpose()[['mean','std']]

                  mean           std
age          39.222139     14.044333
bmi          30.663452      6.100468
children      1.095737      1.205571
charges   13279.121487  12110.359656

Display basic statistics of the _df_ object for categorical variables and transpose the resulting _DataFrame_ object.

In [21]:
# enter solution here
df.describe(include=['category']).transpose()

       count unique        top  freq
sex     1337      2       male   675
smoker  1337      2         no  1063
region  1337      4  southeast   364

Check if there are any missing data in the _df_ object.

In [22]:
# enter solution here
print(df.info())
print("---------------------")
print(df['age'].sort_values().value_counts()[:].index)
print("---------------------")
print(df['sex'].sort_values().value_counts()[:].index)
print("---------------------")
print(df['bmi'].sort_values().value_counts()[:].index)
print("---------------------")
print(df['children'].sort_values().value_counts()[:].index)
print("---------------------")
print(df['smoker'].sort_values().value_counts()[:].index)
print("---------------------")
print(df['region'].sort_values().value_counts()[:].index)
print("---------------------")
print(df['charges'].sort_values().value_counts()[:].index)
print("---------------------")
# conclusion look like no missing record

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1337 entries, 0 to 1337
Data columns (total 7 columns):
age         1337 non-null int64
sex         1337 non-null category
bmi         1337 non-null float64
children    1337 non-null int64
smoker      1337 non-null category
region      1337 non-null category
charges     1337 non-null float64
dtypes: category(3), float64(2), int64(2)
memory usage: 56.5 KB
None
---------------------
Int64Index([18, 19, 51, 45, 46, 47, 48, 50, 52, 20, 26, 54, 53, 25, 24, 49, 23,
            22, 21, 27, 28, 31, 29, 30, 41, 43, 44, 40, 42, 57, 34, 33, 32, 56,
            55, 59, 58, 39, 38, 35, 36, 37, 63, 60, 61, 62, 64],
           dtype='int64')
---------------------
CategoricalIndex(['male', 'female'], categories=['female', 'male'], ordered=False, dtype='category')
---------------------
Float64Index([  32.3,  28.31,  31.35,   34.1,  28.88, 30.875,   30.8, 30.495,
                25.8, 27.645,
              ...
               25.85,   34.5,   31.3, 42.655,  24.75,  46.75,   32.5,   32.4,
                33.5,   18.5],
             dtype='float64', length=548)
---------------------
Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')
---------------------
CategoricalIndex(['no', 'yes'], categories=['no', 'yes'], ordered=False, dtype='category')
---------------------
CategoricalIndex(['southeast', 'southwest', 'northwest', 'northeast'], categories=['northeast', 'northwest', 'southeast', 'southwest'], ordered=False, dtype='category')
---------------------
Float64Index([         8534.6718,          9304.7019,           3172.018,
                       12646.207, 7740.3369999999995,         2755.02095,
                      11830.6072,         40904.1995,        11394.06555,
                        9715.841,
              ...
                       18310.742,        24227.33724,         11554.2236,
                       6117.4945,           7371.772,          6770.1925,
                      7421.19455,         18328.2381,         9910.35985,
                     34254.05335],
             dtype='float64', length=1337)
---------------------

### <a name='6'></a> Exercise 86
Using the _plotly express_ library, build the histogram of the _charges_ variable.

Use the _px.histogram()_ function with the following parameters:
* width = 800
* height = 400
* nbins = 50
* facet_col = 'smoker'
* facet_row = 'sex'

Using the _plotly express_ library, find the distribution of the _smoker_ variable.

Use the _px.histogram()_ function with the following parameters:
* width = 800
* height = 400
* facet_col = 'sex'
* color = 'sex'

In [23]:
# enter solution here

### <a name='7'></a> Exercise 87
Convert categorical variables of the _df_ object to 0-1 encoding and assign it to the _df_dummies_ variable.  

__Tip:__ Use the _pd.get_dummies()_ function with the `drop_first = True` parameter.

In [24]:
# enter solution here
df_dummies = pd.get_dummies(data=df, columns=['sex','smoker','region'])
df_dummies

,age,bmi,children,charges,sex_female,sex_male,smoker_no,smoker_yes,region_northeast,region_northwest,region_southeast,region_southwest
0,19,27.900,0,16884.92400,1,0,0,1,0,0,0,1
1,18,33.770,1,1725.55230,0,1,1,0,0,0,1,0
2,28,33.000,3,4449.46200,0,1,1,0,0,0,1,0
3,33,22.705,0,21984.47061,0,1,1,0,0,1,0,0
4,32,28.880,0,3866.85520,0,1,1,0,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
1333,50,30.970,3,10600.54830,0,1,1,0,0,1,0,0
1334,18,31.920,0,2205.98080,1,0,1,0,1,0,0,0
1335,18,36.850,0,1629.83350,1,0,1,0,0,0,1,0
1336,21,25.800,0,2007.94500,1,0,1,0,0,0,0,1
1337,61,29.070,0,29141.36030,1,0,0,1,0,1,0,0

### <a name='8'></a> Exercise 88
Determine the correlations of variables in the _df_dummies_ object and assign it to the _corr_ variable.

In [25]:
# enter solution here
corr = df_dummies.corr()

corr

,age,bmi,children,charges,sex_female,sex_male,smoker_no,smoker_yes,region_northeast,region_northwest,region_southeast,region_southwest
age,1.000000,0.109344,0.041536,0.298308,0.019814,-0.019814,0.025587,-0.025587,0.001868,0.001495,-0.012311,0.009415
bmi,0.109344,1.000000,0.012755,0.198401,-0.046397,0.046397,-0.003746,0.003746,-0.138178,-0.136138,0.270057,-0.006211
children,0.041536,0.012755,1.000000,0.067389,-0.017848,0.017848,-0.007331,0.007331,-0.023202,0.026044,-0.023492,0.021538
charges,0.298308,0.198401,0.067389,1.000000,-0.058044,0.058044,-0.787234,0.787234,0.005945,-0.038695,0.073578,-0.043637
sex_female,0.019814,-0.046397,-0.017848,-0.058044,1.000000,-1.000000,0.076596,-0.076596,0.002008,0.012482,-0.017578,0.003767
sex_male,-0.019814,0.046397,0.017848,0.058044,-1.000000,1.000000,-0.076596,0.076596,-0.002008,-0.012482,0.017578,-0.003767
smoker_no,0.025587,-0.003746,-0.007331,-0.787234,0.076596,-0.076596,1.000000,-1.000000,-0.002597,0.036321,-0.068282,0.037168
smoker_yes,-0.025587,0.003746,0.007331,0.787234,-0.076596,0.076596,-1.000000,1.000000,0.002597,-0.036321,0.068282,-0.037168
region_northeast,0.001868,-0.138178,-0.023202,0.005945,0.002008,-0.002008,-0.002597,0.002597,1.000000,-0.319842,-0.345909,-0.320493
region_northwest,0.001495,-0.136138,0.026044,-0.038695,0.012482,-0.012482,0.036321,-0.036321,-0.319842,1.000000,-0.345909,-0.320493
region_southeast,-0.012311,0.270057,-0.023492,0.073578,-0.017578,0.017578,-0.068282,0.068282,-0.345909,-0.345909,1.000000,-0.346614
region_southwest,0.009415,-0.006211,0.021538,-0.043637,0.003767,-0.003767,0.037168,-0.037168,-0.320493,-0.320493,-0.346614,1.000000

Extract the column from the _corr_ object for the _charges_ variable (as a DataFrame object) and sort the values in descending order.

In [26]:
# enter solution here
corr[['charges']].sort_values(by='charges')

                   charges
smoker_no        -0.787234
sex_female       -0.058044
region_southwest -0.043637
region_northwest -0.038695
region_northeast  0.005945
sex_male          0.058044
children          0.067389
region_southeast  0.073578
bmi               0.198401
age               0.298308
smoker_yes        0.787234
charges           1.000000

Using the _plotly express_ library, create a bar chart for such sorted values. Skip the first element of the object.

In [27]:
# enter solution here

### <a name='9'></a> Exercise 89
Copy the _df_dummies_ object to the _data_ variable. Then pop the _charges_ column from this object and assign it to the _target_ variable.

In [28]:
# enter solution here
target = df_dummies.drop(labels='charges', axis=1).copy()

Display the first 5 rows of _data_. Make sure the _charges_ column is not in it.

In [29]:
# enter solution here
target.head()

,age,bmi,children,sex_female,sex_male,smoker_no,smoker_yes,region_northeast,region_northwest,region_southeast,region_southwest
0,19,27.900,0,1,0,0,1,0,0,0,1
1,18,33.770,1,0,1,1,0,0,0,1,0
2,28,33.000,3,0,1,1,0,0,0,1,0
3,33,22.705,0,0,1,1,0,0,1,0,0
4,32,28.880,0,0,1,1,0,0,1,0,0

Display the first 5 rows of _target_.

In [30]:
# enter solution here
target.head(5)

,age,bmi,children,sex_female,sex_male,smoker_no,smoker_yes,region_northeast,region_northwest,region_southeast,region_southwest
0,19,27.900,0,1,0,0,1,0,0,0,1
1,18,33.770,1,0,1,1,0,0,0,1,0
2,28,33.000,3,0,1,1,0,0,0,1,0
3,33,22.705,0,0,1,1,0,0,1,0,0
4,32,28.880,0,0,1,1,0,0,1,0,0

############## <a name='10'></a> Exercise 90
Using the _scikit-learn_ library and the _train_test_split_ function, divide the data from the _data_ and _target_ objects into a training set (_X\_train_, _y\_train_) and a test set (_X\_test_, _y\_test_). Assign 20% of the samples to the test set.

Display object size:
* _X\_train_
* _X\_test_
* _y\_train_
* _y\_test_

In [107]:
# enter solution here
from sklearn.model_selection import train_test_split
x = target[['age','bmi','children','sex_female','sex_male','smoker_no','smoker_yes','region_northeast','region_northwest','region_southeast','region_southwest']]
y = target[['bmi']]

X_train, X_test, y_train, y_test = train_test_split(x, y, random_state=0, train_size = .80)

Save objects:
* _X\_train_
* _X\_test_
* _y\_train_
* _y\_test_  

to csv files with the appropriate name:
* X_train.csv
* X_test.csv
* y_train.csv
* y_test.csv

In [108]:
# enter solution here
X_train.to_csv("X_train.csv")
X_test.to_csv("X_test.csv")
y_train.to_csv("y_train.csv")
y_test.to_csv("y_test.csv")

Run the cell below to check.

In [109]:
!head -5 X_test.csv
!head -5 X_train.csv
!head -5 y_train.csv
!head -5 y_test.csv

'head' is not recognized as an internal or external command,
operable program or batch file.
'head' is not recognized as an internal or external command,
operable program or batch file.
'head' is not recognized as an internal or external command,
operable program or batch file.
'head' is not recognized as an internal or external command,
operable program or batch file.

##############  <a name='1'></a> Exercise 91
Create the _DataFrame_ object from the _data_ dictionary below and assign it to the _df_ variable.

```
data = {
    'size': ['XL', 'L', 'M', 'L', 'M'],
    'color': ['red', 'green', 'blue', 'green', 'red'],
    'gender': ['female', 'male', 'male', 'female', 'female'],
    'price': [199.0, 89.0, 99.0, 129.0, 79.0],
    'weight': [500, 450, 300, 380, 410],
    'bought': ['yes', 'no', 'yes', 'no', 'yes']
}
```

In [39]:
data = {
    'size': ['XL', 'L', 'M', 'L', 'M'],
    'color': ['red', 'green', 'blue', 'green', 'red'],
    'gender': ['female', 'male', 'male', 'female', 'female'],
    'price': [199.0, 89.0, 99.0, 129.0, 79.0],
    'weight': [500, 450, 300, 380, 410],
    'bought': ['yes', 'no', 'yes', 'no', 'yes']
}

# enter solution here
df = pd.DataFrame(data)
df

  size  color  gender  price  weight bought
0   XL    red  female  199.0     500    yes
1    L  green    male   89.0     450     no
2    M   blue    male   99.0     300    yes
3    L  green  female  129.0     380     no
4    M    red  female   79.0     410    yes

Display basic information about the object _df_.

In [40]:
# enter solution here
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
size      5 non-null object
color     5 non-null object
gender    5 non-null object
price     5 non-null float64
weight    5 non-null int64
bought    5 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 368.0+ bytes

Convert variables to types:
* size -> _category_
* color -> _category_
* gender -> _category_
* weight -> _float_
* bought -> _category_

In [47]:
# enter solution here
df= df.astype({"size":'category',"color":'category',"gender":'category',"bought":'category',"weight":'float'})

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
size      5 non-null category
color     5 non-null category
gender    5 non-null category
price     5 non-null float64
weight    5 non-null float64
bought    5 non-null category
dtypes: category(4), float64(2)
memory usage: 628.0 bytes

##############  <a name='2'></a> Exercise 92
Use the _scikit-learn_ machine learning library and the _LabelEncoder_ class to code 0-1 of the _bought_ variable. Assign changes to the _df_ object permanently and display the object.

In [124]:
# enter solution here
from sklearn.preprocessing import LabelEncoder,OneHotEncoder,StandardScaler

LE = LabelEncoder()
df['bought'] = LE.fit_transform(df['bought'])
df

  size  color  gender  price  weight  bought
0   XL    red  female  199.0   500.0       1
1    L  green    male   89.0   450.0       0
2    M   blue    male   99.0   300.0       1
3    L  green  female  129.0   380.0       0
4    M    red  female   79.0   410.0       1

Use the appropriate method of the _LabelEncoder_ class to restore the original values of the _bought_ variable. Note the type of the _bought_ variable.

In [113]:
# enter solution here
df['bought'] = LE.inverse_transform(df['bought'])
df

  size  color  gender  price  weight bought
0   XL    red  female  199.0   500.0    yes
1    L  green    male   89.0   450.0     no
2    M   blue    male   99.0   300.0    yes
3    L  green  female  129.0   380.0     no
4    M    red  female   79.0   410.0    yes

##############  <a name='3'></a> Exercise 93
Using the machine learning library _scikit-learn_ and the _OneHotEncoder_ class, encode 0-1 of the _size_ variable. Don't assign changes to the _df_ object.

Use the `sparse = False` parameter of the _OneHotEncoder_ class.

In [116]:
# enter solution here
OHE = OneHotEncoder(sparse=False)
OHE.fit_transform(df[['size']])

array([[0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 1., 0.]])

Using the machine learning library _scikit-learn_ and the _OneHotEncoder_ class, encode 0-1 of the _size_ variable. Don't assign changes to the _df_ object.

Use the parameter `sparse = False` and `drop = first` of the _OneHotEncoder_ class.

In [118]:
# enter solution here
OHE = OneHotEncoder(sparse=False,drop = 'first')
OHE.fit_transform(df[['size']])

array([[0., 1.],
       [0., 0.],
       [1., 0.],
       [0., 0.],
       [1., 0.]])

##############  <a name='4'></a> Exercise 94
Using the _pandas_ library and the _get_dummies()_ function, present all categorical variables of the _df_ object in the form of 0-1 encoding. Don't assign changes permanently to the _df_ object.

In [119]:
# enter solution here
pd.get_dummies(data=df)

,price,weight,size_L,size_M,size_XL,color_blue,color_green,color_red,gender_female,gender_male,bought_no,bought_yes
0,199.0,500.0,0,0,1,0,0,1,1,0,0,1
1,89.0,450.0,1,0,0,0,1,0,0,1,1,0
2,99.0,300.0,0,1,0,1,0,0,0,1,0,1
3,129.0,380.0,1,0,0,0,1,0,1,0,1,0
4,79.0,410.0,0,1,0,0,0,1,1,0,0,1

Using the _pandas_ library and the _get_dummies()_ function, present all categorical variables of the _df_ object in the form of 0-1 encoding. Use the `drop_first = True` parameter. Don't assign changes permanently to the _df_ object.

In [122]:
# enter solution here
pd.get_dummies(data=df,columns=['size','color','gender'], drop_first=True)

   price  weight bought  size_M  size_XL  color_green  color_red  gender_male
0  199.0   500.0    yes       0        1            0          1            0
1   89.0   450.0     no       0        0            1          0            1
2   99.0   300.0    yes       1        0            0          0            1
3  129.0   380.0     no       0        0            1          0            0
4   79.0   410.0    yes       1        0            0          1            0

Using the _pandas_ library and the _get_dummies()_ function, present the _size_ variable of the _df_ object in the form of 0-1 encoding. Use the `drop_first = True` parameter. Don't assign changes permanently to the _df_ object.

In [123]:
# enter solution here
pd.get_dummies(data=df,columns=['size'], drop_first=True)

   color  gender  price  weight bought  size_M  size_XL
0    red  female  199.0   500.0    yes       0        1
1  green    male   89.0   450.0     no       0        0
2   blue    male   99.0   300.0    yes       1        0
3  green  female  129.0   380.0     no       0        0
4    red  female   79.0   410.0    yes       1        0

##############  <a name='5'></a> Exercise 95
Use the _scikit-learn_ machine learning library and the _StandardScaler_ class to scale the _weight_ variable. Don't assign changes to the _df_ object.

In [127]:
# enter solution here
scaler = StandardScaler()
scaler.fit_transform(df[['weight']])

array([[ 1.3660019 ],
       [ 0.62360956],
       [-1.60356745],
       [-0.41573971],
       [ 0.02969569]])

##############  <a name='6'></a> Exercise 96
Load the _data_ dictionary again into the _DataFrame_ object named _df_.

In [131]:
# enter solution here
# enter solution here
df = pd.DataFrame(data)
df

  size  color  gender  price  weight bought
0   XL    red  female  199.0     500    yes
1    L  green    male   89.0     450     no
2    M   blue    male   99.0     300    yes
3    L  green  female  129.0     380     no
4    M    red  female   79.0     410    yes

In [132]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
size      5 non-null object
color     5 non-null object
gender    5 non-null object
price     5 non-null float64
weight    5 non-null int64
bought    5 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 368.0+ bytes

Prepare the data for the machine learning model:
* using the LabelEncoder class, encode 0-1 of the _bought_ variable
* standardize the variables _weight_ and _price_
* encode 0-1 categorical variables using the function _get_dummies()._

Assign changes to the _df_prep_ variable.

In [133]:
# enter solution here
df['bought'] = LE.fit_transform(df['bought'])
df['weight'] = scaler.fit_transform(df[['weight']])
df['price'] = scaler.fit_transform(df[['price']])
df

  size  color  gender     price    weight  bought
0   XL    red  female  1.845062  1.366002       1
1    L  green    male -0.691898  0.623610       0
2    M   blue    male -0.461266 -1.603567       1
3    L  green  female  0.230633 -0.415740       0
4    M    red  female -0.922531  0.029696       1

In [134]:
df_prep = pd.get_dummies(data=df,columns=['size','color','gender'])

In [135]:
df_prep

,price,weight,bought,size_L,size_M,size_XL,color_blue,color_green,color_red,gender_female,gender_male
0,1.845062,1.366002,1,0,0,1,0,0,1,1,0
1,-0.691898,0.623610,0,1,0,0,0,1,0,0,1
2,-0.461266,-1.603567,1,0,1,0,1,0,0,0,1
3,0.230633,-0.415740,0,1,0,0,0,1,0,1,0
4,-0.922531,0.029696,1,0,1,0,0,0,1,1,0

##############  <a name='7'></a> Exercise 97
Copy the _df_prep_ object to the _data_ variable. Then pop the _bought_ column from this object and assign it to the _target_ variable.

In [ ]:
# enter solution here

Display the first 5 rows of _data_. Make sure the _bought_ column is not in it.

In [ ]:
# enter solution here

Display the first 5 rows of _target_.

In [ ]:
# enter solution here

##############  <a name='8'></a> Exercise 98
Using the _scikit-learn_ library and the _train_test_split_ function, divide the data from the _data_ and _target_ objects into a training set (_X\_train_, _y\_train_) and a test set (_X\_test_, _y\_test_). Assign 20% of the samples to the test set.

Display object size:
* _X\_train_
* _X\_test_
* _y\_train_
* _y\_test_

In [ ]:
# enter solution here

##############  <a name='9'></a> Exercise 99
Combine _X\_train_ and _X\_test_ objects into one _DataFrame_ object named _X_.

In [ ]:
# enter solution here

##############  <a name='10'></a> Exercise 100
Combine the _y\_train_ and _y\_test_ objects into one _DataFrame_ object named _y_.

In [ ]:
# enter solution here

Combine _X_ and _y_ objects into one _DataFrame_ object.

In [ ]:
# enter solution here